#include <iostream>
#include <vector>
#include <algorithm>

int main() {
    int a1, a2, a3;
    std::cin >> a1 >> a2 >> a3;  // стоимости: удаление, вставка, замена
    
    std::string s1, s2;
    std::cin >> s1 >> s2;
    int n = s1.length();
    int m = s2.length();
    
    // dp[i][j] - минимальная стоимость преобразования первых i символов s1 в первые j символов s2
    std::vector<std::vector<int>> dp(n + 1, std::vector<int>(m + 1, 0));
    
    // Инициализация: преобразование в пустую строку и из пустой строки
    for (int i = 0; i <= n; ++i) {
        dp[i][0] = i * a1;  // удаляем все символы из s1
    }
    for (int j = 0; j <= m; ++j) {
        dp[0][j] = j * a2;  // вставляем все символы в s2
    }
    
    // Заполнение DP таблицы
    for (int i = 1; i <= n; ++i) {
        for (int j = 1; j <= m; ++j) {
            if (s1[i - 1] == s2[j - 1]) {
                // Символы совпадают - берем без изменений
                dp[i][j] = dp[i - 1][j - 1];
            } else {
                // Символы разные - выбираем минимальную стоимость из трех операций:
                dp[i][j] = std::min({
                    dp[i - 1][j] + a1,     // удаление символа из s1
                    dp[i][j - 1] + a2,     // вставка символа в s1
                    dp[i - 1][j - 1] + a3  // замена символа
                });
            }
        }
    }
    
    std::cout << "Минимальная стоимость: " << dp[n][m] << std::endl;

    // для восстановления ответа идем с клетки dp[n][m] вверх по принципу, 
    // если s1[i-1] == s2[j-1] - значит нихуя не делали
    // если dp[i][j] == dp[i - 1][j] + a1 - то удалили элмент из s1
    // если dp[i][j] == dp[i][j - 1] + a2 - то вставили элемента в s1
    // если dp[i][j] == dp[i - 1][j - 1] + a3 - то заменили элемент
}